In [1]:
import pandas as pd

In [2]:
PATH = '../data'

#### Customer_Master_Data

In [3]:
cust_df = pd.read_csv(f'{PATH}/customer_master_data.csv')
cust_df.head()

,Unnamed: 0,Customer_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status
0,0,1000001,F,0-17,10,A,2,0
1,4,1000002,M,55+,16,C,4,0
2,5,1000003,M,26-35,15,A,3,0
3,6,1000004,M,46-50,7,B,2,1
4,9,1000005,M,26-35,20,A,1,1

In [4]:
column_to_drop = cust_df.columns[0]
cust_df = cust_df.drop(columns=column_to_drop)

In [7]:
cust_df.to_csv(f'{PATH}/customer_master_data.csv', index=False)

In [5]:
cust_df.head()

,Customer_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status
0,1000001,F,0-17,10,A,2,0
1,1000002,M,55+,16,C,4,0
2,1000003,M,26-35,15,A,3,0
3,1000004,M,46-50,7,B,2,1
4,1000005,M,26-35,20,A,1,1

In [16]:
print(f"Shape: {cust_df.shape}")
cust_df.isnull().sum()

Shape: (5891, 7)

Customer_ID                   0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
dtype: int64

#### Produuct_Master_Data

In [8]:
prod_df = pd.read_csv(f'{PATH}/product_master_data.csv')
prod_df.head()

,Unnamed: 0,Product_ID,Product_Category,price$,storeID,supplierID,storeName,supplierName
0,0,P00069042,Home & Kitchen,77.51,2,13,Tech Haven,Samsung Electronics
1,1,P00248942,Grocery,9.63,6,9,Photo World,Canon Inc.
2,2,P00087842,Pets,31.66,4,18,Game Zone,Razer Inc.
3,3,P00085442,Pets,23.32,1,16,Electro Mart,Sony Corporation
4,4,P00285442,Toys,34.71,3,39,Sound Zone,Sonos Inc.

In [9]:
column_to_drop = prod_df.columns[0]
prod_df = prod_df.drop(columns=column_to_drop)

In [10]:
prod_df.to_csv(f'{PATH}/product_master_data.csv', index=False)

In [11]:
prod_df.head()

,Product_ID,Product_Category,price$,storeID,supplierID,storeName,supplierName
0,P00069042,Home & Kitchen,77.51,2,13,Tech Haven,Samsung Electronics
1,P00248942,Grocery,9.63,6,9,Photo World,Canon Inc.
2,P00087842,Pets,31.66,4,18,Game Zone,Razer Inc.
3,P00085442,Pets,23.32,1,16,Electro Mart,Sony Corporation
4,P00285442,Toys,34.71,3,39,Sound Zone,Sonos Inc.

In [15]:
print(f"Shape: {prod_df.shape}")
prod_df.isnull().sum()

Shape: (3631, 7)

Product_ID          0
Product_Category    0
price$              0
storeID             0
supplierID          0
storeName           0
supplierName        0
dtype: int64

#### Transactional_Data

In [12]:
trans_df = pd.read_csv(f'{PATH}/transactional_data.csv')
trans_df.head()

   Unnamed: 0  orderID  Customer_ID Product_ID  quantity        date
0           0  9914432      1000001  P00069042         1  2020-12-29
1           1  1676537      1000001  P00248942         3  2017-03-27
2           2  8910457      1000001  P00087842         1  2017-08-20
3           3  5044982      1000001  P00085442         1  2019-03-03
4           4  4176351      1000002  P00285442         1  2018-07-11

In [13]:
column_to_drop = trans_df.columns[0]
trans_df = trans_df.drop(columns=column_to_drop)

In [14]:
trans_df.to_csv(f'{PATH}/transactional_data.csv', index=False)

In [15]:
trans_df.head()

   orderID  Customer_ID Product_ID  quantity        date
0  9914432      1000001  P00069042         1  2020-12-29
1  1676537      1000001  P00248942         3  2017-03-27
2  8910457      1000001  P00087842         1  2017-08-20
3  5044982      1000001  P00085442         1  2019-03-03
4  4176351      1000002  P00285442         1  2018-07-11

In [20]:
print(f"Shape: {trans_df.shape}")
trans_df.isnull().sum()

Shape: (550068, 5)

orderID        0
Customer_ID    0
Product_ID     0
quantity       0
date           0
dtype: int64